OpenNuvoton/M55M1BSP/Library/CryptoAccelerator/ecdsa_alt.c
    return 0;
}


static int run_ecc_codec(mbedtls_ecp_group *grp, uint32_t mode)
{
    CRYPTO_T *crpt = CRYPTO;
    uint32_t eccop;
    uint32_t timeout = 200000000;

    //CRYPTO_ECC_CTL_CURVEM_Pos) | ECCOP_POINT_MUL | CRYPTO_ECC_CTL_SCAP_Msk | CRYPTO_ECC_CTL_START_Msk;

    eccop = mode & CRYPTO_ECC_CTL_ECCOP_Msk;

    if (eccop == ECCOP_MODULE)
    {
        crpt->ECC_CTL = CRYPTO_ECC_CTL_FSEL_Msk;
    }
    else
    {
        /* CURVE_GF_P */
        crpt->ECC_CTL = CRYPTO_ECC_CTL_FSEL_Msk;

        if (eccop == ECCOP_POINT_MUL)
        {
            /* Enable side-channel protection in some operation */
            crpt->ECC_CTL |= CRYPTO_ECC_CTL_SCAP_Msk;
            /* If SCAP enabled, the curve order must be written to ECC_X2 */
            //Hex2Reg(pCurve->Eorder, crpt->ECC_X2);
            ECC_Copy((uint32_t *)crpt->ECC_X2, grp->N.MBEDTLS_PRIVATE(p), mbedtls_mpi_size(&grp->N));
        }
    }

    /* Clear ECC flag */
    crpt->INTSTS = CRYPTO_INTSTS_ECCIF_Msk;

    /* Start calculation */
    crpt->ECC_CTL |= (grp->pbits << CRYPTO_ECC_CTL_CURVEM_Pos) | mode | CRYPTO_ECC_CTL_START_Msk;

    /* Waiting for calculation */
    while ((crpt->INTSTS & CRYPTO_INTSTS_ECCIF_Msk) == 0)
    {
        if (timeout-- <= 0)
            return MBEDTLS_ERR_ECP_HW_ACCEL_FAILED;
    }

    return 0;
}
#endif /* MBEDTLS_ECDSA_SIGN_ALT || MBEDTLS_ECDSA_VERIFY_ALT */

#if defined(MBEDTLS_ECDSA_SIGN_ALT)


int mbedtls_ecdsa_can_do(mbedtls_ecp_group_id gid)
{
    switch (gid)
    {
#ifdef MBEDTLS_ECP_DP_CURVE25519_ENABLED

        case MBEDTLS_ECP_DP_CURVE25519:
            return 0;
#endif
#ifdef MBEDTLS_ECP_DP_CURVE448_ENABLED

        case MBEDTLS_ECP_DP_CURVE448:
            return 0;
#endif

        default:
            return 1;
    }
}


int32_t  ECC_Sign(mbedtls_ecp_group *grp, mbedtls_mpi *r, mbedtls_mpi *s,
                  const mbedtls_mpi *d, const unsigned char *buf, size_t blen,
                  int (*f_rng)(void *, unsigned char *, size_t), void *p_rng)
{
    uint32_t volatile temp_result1[18], temp_result2[18];
    CRYPTO_T *crpt = CRYPTO;
    size_t len, nblimbs;
    mbedtls_mpi e;
    mbedtls_mpi k, *pk;


    /* Fail cleanly on curves such as Curve25519 that can't be used for ECDSA */
    if (!mbedtls_ecdsa_can_do(grp->id) || grp->N.MBEDTLS_PRIVATE(p) == NULL)
        return (MBEDTLS_ERR_ECP_BAD_INPUT_DATA);

    /* Make sure d is in range 1..n-1 */
    if (mbedtls_mpi_cmp_int(d, 1) < 0 || mbedtls_mpi_cmp_mpi(d, &grp->N) >= 0)
        return (MBEDTLS_ERR_ECP_INVALID_KEY);


    pk = &k;
    mbedtls_mpi_init(pk);

    ECC_FixCurve(grp);

    /* Generate a random k. It will use CRYPTO SHA*/
    mbedtls_ecp_gen_privkey(grp, pk, f_rng, p_rng);

    /* Reset Crypto */
    SYS->CRYPTORST |= SYS_CRYPTORST_CRYPTO0RST_Msk;
    SYS->CRYPTORST = 0;

    ECC_InitCurve(grp);

    /*
        *   1. Calculate e = HASH(m), where HASH is a cryptographic hashing algorithm, (i.e. SHA-1)
        *      (1) Use SHA to calculate e
        */

    /*   2. Select a random integer k form [1, n-1]
    *      (1) Notice that n is order, not prime modulus or irreducible polynomial function
    */

    /*
    *   3. Compute r = x1 (mod n), where (x1, y1) = k * G. If r = 0, go to step 2
    *      (1) Write the curve parameter A, B, and curve length M to corresponding registers
    *      (2) Write the prime modulus or irreducible polynomial function to N registers according
    *      (3) Write the point G(x, y) to X1, Y1 registers
    *      (4) Write the random integer k to K register
    *      (5) Set ECCOP(CRPT_ECC_CTL[10:9]) to 00
    *      (6) Set FSEL(CRPT_ECC_CTL[8]) according to used curve of prime field or binary field
    *      (7) Set START(CRPT_ECC_CTL[0]) to 1
    *      (8) Wait for BUSY(CRPT_ECC_STS[0]) be cleared
    *      (9) Write the curve order and curve length to N ,M registers according
    *      (10) Write 0x0 to Y1 registers
    *      (11) Set ECCOP(CRPT_ECC_CTL[10:9]) to 01
    *      (12) Set MOPOP(CRPT_ECC_CTL[12:11]) to 10
    *      (13) Set START(CRPT_ECC_CTL[0]) to 1         *
    *      (14) Wait for BUSY(CRPT_ECC_STS[0]) be cleared
    *      (15) Read X1 registers to get r
    */

    /* 3-(4) Write the random integer k to K register */
    ECC_ZeroReg((uint32_t *)crpt->ECC_K);
    ECC_Copy((uint32_t *)crpt->ECC_K, pk->MBEDTLS_PRIVATE(p), mbedtls_mpi_size(pk));

    run_ecc_codec(grp, ECCOP_POINT_MUL);

    /*  3-(9) Write the curve order to N registers */
    //Hex2Reg(pCurve->Eorder, crpt->ECC_N);
    ECC_ZeroReg((uint32_t *)crpt->ECC_N);
    ECC_Copy((uint32_t *)crpt->ECC_N, grp->N.MBEDTLS_PRIVATE(p), mbedtls_mpi_size(&grp->N));

    /* 3-(10) Write 0x0 to Y1 registers */
    ECC_ZeroReg((uint32_t *)crpt->ECC_Y1);

    run_ecc_codec(grp, ECCOP_MODULE | MODOP_ADD);

    /* 3-(15) Read X1 registers to get r */
    len = grp->pbits / 8 + ((grp->pbits & 0x7) != 0);
    nblimbs = len / 4 + ((len & 0x3) != 0);
    mbedtls_mpi_grow(r, nblimbs);
    mbedtls_mpi_grow(s, nblimbs);
    ECC_Copy(r->MBEDTLS_PRIVATE(p), (uint32_t *)crpt->ECC_X1, len);
    ECC_Copy((uint32_t *)temp_result1, (uint32_t *)crpt->ECC_X1, len);

    /*
        *   4. Compute s = k^-1 * (e + d * r)(mod n). If s = 0, go to step 2
        *      (1) Write the curve order to N registers according
        *      (2) Write 0x1 to Y1 registers
        *      (3) Write the random integer k to X1 registers according
        *      (4) Set ECCOP(CRPT_ECC_CTL[10:9]) to 01
        *      (5) Set MOPOP(CRPT_ECC_CTL[12:11]) to 00
        *      (6) Set START(CRPT_ECC_CTL[0]) to 1
        *      (7) Wait for BUSY(CRPT_ECC_STS[0]) be cleared
        *      (8) Read X1 registers to get k^-1
        *      (9) Write the curve order and curve length to N ,M registers
        *      (10) Write r, d to X1, Y1 registers
        *      (11) Set ECCOP(CRPT_ECC_CTL[10:9]) to 01
        *      (12) Set MOPOP(CRPT_ECC_CTL[12:11]) to 01
        *      (13) Set START(CRPT_ECC_CTL[0]) to 1
        *      (14) Wait for BUSY(CRPT_ECC_STS[0]) be cleared
        *      (15) Write the curve order to N registers
        *      (16) Write e to Y1 registers
        *      (17) Set ECCOP(CRPT_ECC_CTL[10:9]) to 01
        *      (18) Set MOPOP(CRPT_ECC_CTL[12:11]) to 10
        *      (19) Set START(CRPT_ECC_CTL[0]) to 1
        *      (20) Wait for BUSY(CRPT_ECC_STS[0]) be cleared
        *      (21) Write the curve order and curve length to N ,M registers
        *      (22) Write k^-1 to Y1 registers
        *      (23) Set ECCOP(CRPT_ECC_CTL[10:9]) to 01
        *      (24) Set MOPOP(CRPT_ECC_CTL[12:11]) to 01
        *      (25) Set START(CRPT_ECC_CTL[0]) to 1
        *      (26) Wait for BUSY(CRPT_ECC_STS[0]) be cleared
        *      (27) Read X1 registers to get s
        */

