OpenNuvoton/M55M1BSP/Library/CryptoAccelerator/ecdsa_alt.c
    /* S/W: GFp_add_mod_order(pCurve->key_len+2, 0, x1, a, R); */

    /*  4-(1) Write the curve order to N registers */
    //Hex2Reg(pCurve->Eorder, crpt->ECC_N);
    ECC_ZeroReg((uint32_t *)crpt->ECC_N);
    ECC_Copy((uint32_t *)crpt->ECC_N, grp->N.MBEDTLS_PRIVATE(p), mbedtls_mpi_size(&grp->N));

    /*  4-(2) Write 0x1 to Y1 registers */
    ECC_ZeroReg((uint32_t *)crpt->ECC_Y1);
    crpt->ECC_Y1[0] = 0x1UL;

    /*  4-(3) Write the random integer k to X1 registers */
    ECC_ZeroReg((uint32_t *)crpt->ECC_X1);
    ECC_Copy((uint32_t *)crpt->ECC_X1, pk->MBEDTLS_PRIVATE(p), mbedtls_mpi_size(pk));


    run_ecc_codec(grp, ECCOP_MODULE | MODOP_DIV);

    /*  4-(8) Read X1 registers to get k^-1 */
    ECC_Copy((uint32_t *)temp_result2, (uint32_t *)crpt->ECC_X1, 72);


    /*  4-(9) Write the curve order and curve length to N ,M registers */
    ECC_ZeroReg((uint32_t *)crpt->ECC_N);
    ECC_Copy((uint32_t *)crpt->ECC_N, grp->N.MBEDTLS_PRIVATE(p), mbedtls_mpi_size(&grp->N));

    /*  4-(10) Write r, d to X1, Y1 registers */
    ECC_Copy((uint32_t *)crpt->ECC_X1, (uint32_t *)temp_result1, 72);

    ECC_ZeroReg((uint32_t *)crpt->ECC_Y1);
    ECC_Copy((uint32_t *)crpt->ECC_Y1, d->MBEDTLS_PRIVATE(p), mbedtls_mpi_size(d));

    run_ecc_codec(grp, ECCOP_MODULE | MODOP_MUL);

    /*  4-(15) Write the curve order to N registers */
    ECC_ZeroReg((uint32_t *)crpt->ECC_N);
    ECC_Copy((uint32_t *)crpt->ECC_N, grp->N.MBEDTLS_PRIVATE(p), mbedtls_mpi_size(&grp->N));


    /*  4-(16) Write e to Y1 registers */
    ECC_ZeroReg((uint32_t *)crpt->ECC_Y1);
    mbedtls_mpi_init(&e);
    derive_mpi(grp, &e, buf, blen);

    ECC_Copy((uint32_t *)crpt->ECC_Y1, e.MBEDTLS_PRIVATE(p), mbedtls_mpi_size(&e));
    mbedtls_mpi_free(&e);

    run_ecc_codec(grp, ECCOP_MODULE | MODOP_ADD);


    /*  4-(21) Write the curve order and curve length to N ,M registers */
    ECC_ZeroReg((uint32_t *)crpt->ECC_N);
    ECC_Copy((uint32_t *)crpt->ECC_N, grp->N.MBEDTLS_PRIVATE(p), mbedtls_mpi_size(&grp->N));

    /*  4-(22) Write k^-1 to Y1 registers */
    ECC_Copy((uint32_t *)crpt->ECC_Y1, (uint32_t *)temp_result2, 72);


    run_ecc_codec(grp, ECCOP_MODULE | MODOP_MUL);

    /*  4-(27) Read X1 registers to get s */
    ECC_Copy(s->MBEDTLS_PRIVATE(p), (uint32_t *)crpt->ECC_X1, len);


    mbedtls_mpi_free(pk);


    return 0;
}


/*
 * Compute ECDSA signature of a hashed message
 */
int mbedtls_ecdsa_sign(mbedtls_ecp_group *grp, mbedtls_mpi *r, mbedtls_mpi *s,
                       const mbedtls_mpi *d, const unsigned char *buf, size_t blen,
                       int (*f_rng)(void *, unsigned char *, size_t), void *p_rng)
{
    int ret;

    ECDSA_VALIDATE_RET(grp   != NULL);
    ECDSA_VALIDATE_RET(r     != NULL);
    ECDSA_VALIDATE_RET(s     != NULL);
    ECDSA_VALIDATE_RET(d     != NULL);
    ECDSA_VALIDATE_RET(f_rng != NULL);
    ECDSA_VALIDATE_RET(buf   != NULL || blen == 0);

    ret = ECC_Sign(grp, r, s, d, buf, blen, f_rng, p_rng);

    return ret;

}
#endif /* MBEDTLS_ECDSA_SIGN_ALT */

#if defined(MBEDTLS_ECDSA_VERIFY_ALT)

int  ECC_Verify(mbedtls_ecp_group *grp,
                const unsigned char *buf, size_t blen,
                const mbedtls_ecp_point *Q,
                const mbedtls_mpi *r,
                const mbedtls_mpi *s)
{
    CRYPTO_T *crpt;
    uint32_t  temp_result1[18], temp_result2[18];
    uint32_t  temp_x[18], temp_y[18];
    int32_t   i, ret = 0;
    mbedtls_mpi e;
    int32_t u1_zero_flag = 0;

    /* Reset Crypto */
    SYS->CRYPTORST |= SYS_CRYPTORST_CRYPTO0RST_Msk;
    SYS->CRYPTORST = 0;

    crpt = CRYPTO;
    ECC_FixCurve(grp);
    ECC_InitCurve(grp);

    /*
     *   1. Verify that r and s are integers in the interval [1, n-1]. If not, the signature is invalid
     *   2. Compute e = HASH (m), where HASH is the hashing algorithm in signature generation
     *      (1) Use SHA to calculate e
     */

    /*
     *   3. Compute w = s^-1 (mod n)
     *      (1) Write the curve order to N registers
     *      (2) Write 0x1 to Y1 registers
     *      (3) Write s to X1 registers
     *      (4) Set ECCOP(CRPT_ECC_CTL[10:9]) to 01
     *      (5) Set MOPOP(CRPT_ECC_CTL[12:11]) to 00
     *      (6) Set FSEL(CRPT_ECC_CTL[8]) according to used curve of prime field or binary field
     *      (7) Set START(CRPT_ECC_CTL[0]) to 1
     *      (8) Wait for BUSY(CRPT_ECC_STS[0]) be cleared
     *      (9) Read X1 registers to get w
     */

    /*  3-(1) Write the curve order to N registers */
    ECC_Copy((uint32_t *)crpt->ECC_N, grp->N.MBEDTLS_PRIVATE(p), mbedtls_mpi_size(&grp->N));

    /*  3-(2) Write 0x1 to Y1 registers */
    ECC_ZeroReg((uint32_t *)crpt->ECC_Y1);
    crpt->ECC_Y1[0] = 0x1UL;

    /*  3-(3) Write s to X1 registers */
    ECC_Copy((uint32_t *)crpt->ECC_X1, s->MBEDTLS_PRIVATE(p), mbedtls_mpi_size(s));

    if ((ret = run_ecc_codec(grp, ECCOP_MODULE | MODOP_DIV)))
    {
        return ret;
    }

    /*  3-(9) Read X1 registers to get w */
    ECC_Copy((uint32_t *)temp_result2, (uint32_t *)crpt->ECC_X1, 72);



    /*
        *   4. Compute u1 = e * w (mod n) and u2 = r * w (mod n)
        *      (1) Write the curve order and curve length to N ,M registers
        *      (2) Write e, w to X1, Y1 registers
        *      (3) Set ECCOP(CRPT_ECC_CTL[10:9]) to 01
        *      (4) Set MOPOP(CRPT_ECC_CTL[12:11]) to 01
        *      (5) Set START(CRPT_ECC_CTL[0]) to 1
        *      (6) Wait for BUSY(CRPT_ECC_STS[0]) be cleared
        *      (7) Read X1 registers to get u1
        *      (8) Write the curve order and curve length to N ,M registers
        *      (9) Write r, w to X1, Y1 registers
        *      (10) Set ECCOP(CRPT_ECC_CTL[10:9]) to 01
        *      (11) Set MOPOP(CRPT_ECC_CTL[12:11]) to 01
        *      (12) Set START(CRPT_ECC_CTL[0]) to 1
        *      (13) Wait for BUSY(CRPT_ECC_STS[0]) be cleared
        *      (14) Read X1 registers to get u2
        */

    /*  4-(1) Write the curve order and curve length to N ,M registers */
    ECC_ZeroReg((uint32_t *)crpt->ECC_N);

    //Hex2Reg(pCurve->Eorder, crpt->ECC_N);
    ECC_Copy((uint32_t *)crpt->ECC_N, grp->N.MBEDTLS_PRIVATE(p), mbedtls_mpi_size(&grp->N));

    /* 4-(2) Write e, w to X1, Y1 registers */
    ECC_ZeroReg((uint32_t *)crpt->ECC_X1);

    mbedtls_mpi_init(&e);
    derive_mpi(grp, &e, buf, blen);

    ECC_Copy((uint32_t *)crpt->ECC_X1, e.MBEDTLS_PRIVATE(p), mbedtls_mpi_size(&e));
    mbedtls_mpi_free(&e);

    ECC_Copy((uint32_t *)crpt->ECC_Y1, temp_result2, 72);

    if ((ret = run_ecc_codec(grp, ECCOP_MODULE | MODOP_MUL)))
    {
        return ret;
    }

    /*  4-(7) Read X1 registers to get u1 */
    ECC_Copy((uint32_t *)temp_result1, (uint32_t *)crpt->ECC_X1, 72);

