OpenNuvoton/M55M1BSP/Library/CryptoAccelerator/ecdsa_alt.c
    /*  4-(8) Write the curve order and curve length to N ,M registers */
    ECC_ZeroReg((uint32_t *)crpt->ECC_N);

    ECC_Copy((uint32_t *)crpt->ECC_N, grp->N.MBEDTLS_PRIVATE(p), mbedtls_mpi_size(&grp->N));

    /* 4-(9) Write r, w to X1, Y1 registers */
    ECC_ZeroReg((uint32_t *)crpt->ECC_X1);
    ECC_Copy((uint32_t *)crpt->ECC_X1, r->MBEDTLS_PRIVATE(p), mbedtls_mpi_size(r));

    ECC_Copy((uint32_t *)crpt->ECC_Y1, temp_result2, 72);

    if ((ret = run_ecc_codec(grp, ECCOP_MODULE | MODOP_MUL)))
    {
        return ret;
    }

    /*  4-(14) Read X1 registers to get u2 */
    ECC_Copy((uint32_t *)temp_result2, (uint32_t *)crpt->ECC_X1, 72);

    /*
        *   5. Compute X * (x1', y1') = u1 * G + u2 * Q
        *      (1) Write the curve parameter A, B, N, and curve length M to corresponding registers
        *      (2) Write the point G(x, y) to X1, Y1 registers
        *      (3) Write u1 to K registers
        *      (4) Set ECCOP(CRPT_ECC_CTL[10:9]) to 00
        *      (5) Set START(CRPT_ECC_CTL[0]) to 1
        *      (6) Wait for BUSY(CRPT_ECC_STS[0]) be cleared
        *      (7) Read X1, Y1 registers to get u1*G
        *      (8) Write the curve parameter A, B, N, and curve length M to corresponding registers
        *      (9) Write the public key Q(x,y) to X1, Y1 registers
        *      (10) Write u2 to K registers
        *      (11) Set ECCOP(CRPT_ECC_CTL[10:9]) to 00
        *      (12) Set START(CRPT_ECC_CTL[0]) to 1
        *      (13) Wait for BUSY(CRPT_ECC_STS[0]) be cleared
        *      (14) Write the curve parameter A, B, N, and curve length M to corresponding registers
        *      (15) Write the result data u1*G to X2, Y2 registers
        *      (16) Set ECCOP(CRPT_ECC_CTL[10:9]) to 10
        *      (17) Set START(CRPT_ECC_CTL[0]) to 1
        *      (18) Wait for BUSY(CRPT_ECC_STS[0]) be cleared
        *      (19) Read X1, Y1 registers to get X *(x1', y1')
        *      (20) Write the curve order and curve length to N ,M registers
        *      (21) Write x1 * to X1 registers
        *      (22) Write 0x0 to Y1 registers
        *      (23) Set ECCOP(CRPT_ECC_CTL[10:9]) to 01
        *      (24) Set MOPOP(CRPT_ECC_CTL[12:11]) to 10
        *      (25) Set START(CRPT_ECC_CTL[0]) to 1
        *      (26) Wait for BUSY(CRPT_ECC_STS[0]) be cleared
        *      (27) Read X1 registers to get x1 * (mod n)
        *
        *   6. The signature is valid if x1 * = r, otherwise it is invalid
        */

    /*
    *  (1) Write the curve parameter A, B, N, and curve length M to corresponding registers
    *  (2) Write the point G(x, y) to X1, Y1 registers
    */
    ECC_InitCurve(grp);

    // Skip u1 if e = 0
    for (i = 0; i < 18; i++)
    {
        if (temp_result1[i])
            break;
    }

    // if e != 0
    if (i != 18)
    {
        /* (3) Write u1 to K registers */
        ECC_Copy((uint32_t *)crpt->ECC_K, temp_result1, 72);

        if ((ret = run_ecc_codec(grp, ECCOP_POINT_MUL)))
        {
            return ret;
        }

        /* (7) Read X1, Y1 registers to get u1*G */
        ECC_Copy(temp_x, (uint32_t *)crpt->ECC_X1, 72);
        ECC_Copy(temp_y, (uint32_t *)crpt->ECC_Y1, 72);
    }
    else
    {
        /* u1 is zero */
        u1_zero_flag = 1;
    }

    /* (8) Write the curve parameter A, B, N, and curve length M to corresponding registers */
    ECC_InitCurve(grp);

    /* (9) Write the public key Q(x,y) to X1, Y1 registers */
    ECC_Copy((uint32_t *)crpt->ECC_X1, Q->MBEDTLS_PRIVATE(X).MBEDTLS_PRIVATE(p), mbedtls_mpi_size(&Q->MBEDTLS_PRIVATE(X)));
    ECC_Copy((uint32_t *)crpt->ECC_Y1, Q->MBEDTLS_PRIVATE(Y).MBEDTLS_PRIVATE(p), mbedtls_mpi_size(&Q->MBEDTLS_PRIVATE(Y)));


    /* (10) Write u2 to K registers */
    ECC_Copy((uint32_t *)crpt->ECC_K, (uint32_t *)temp_result2, 72);

    if ((ret = run_ecc_codec(grp, ECCOP_POINT_MUL)))
    {
        return ret;
    }

    ECC_Copy((uint32_t *)temp_result1, (uint32_t *)crpt->ECC_X1, 72);
    ECC_Copy((uint32_t *)temp_result2, (uint32_t *)crpt->ECC_Y1, 72);

    if (u1_zero_flag == 0)
    {
        /* (14) Write the curve parameter A, B, N, and curve length M to corresponding registers */
        ECC_InitCurve(grp);

        /* Write the result data u2*Q to X1, Y1 registers */
        ECC_Copy((uint32_t *)crpt->ECC_X1, (uint32_t *)temp_result1, 72);
        ECC_Copy((uint32_t *)crpt->ECC_Y1, (uint32_t *)temp_result2, 72);

        /* (15) Write the result data u1*G to X2, Y2 registers */
        ECC_Copy((uint32_t *)crpt->ECC_X2, (uint32_t *)temp_x, 72);
        ECC_Copy((uint32_t *)crpt->ECC_Y2, (uint32_t *)temp_y, 72);

        if ((ret = run_ecc_codec(grp, ECCOP_POINT_ADD)))
        {
            return ret;
        }

        /* (19) Read X1, Y1 registers to get X' (x1', y1') */
        ECC_Copy(temp_x, (uint32_t *)crpt->ECC_X1, 72);
        ECC_Copy(temp_y, (uint32_t *)crpt->ECC_Y1, 72);
    }
    else
    {
        ECC_Copy(temp_x, temp_result1, 72);
        ECC_Copy(temp_y, temp_result2, 72);
    }

    /*  (20) Write the curve order and curve length to N ,M registers */
    for (i = 0; i < 18; i++)
    {
        crpt->ECC_N[i] = 0UL;
    }

    ECC_ZeroReg((uint32_t *)crpt->ECC_N);

    ECC_Copy((uint32_t *)crpt->ECC_N, grp->P.MBEDTLS_PRIVATE(p), mbedtls_mpi_size(&grp->P));

    /*
        *  (21) Write x1 * to X1 registers
        *  (22) Write 0x0 to Y1 registers
        */
    ECC_Copy((uint32_t *)crpt->ECC_X1, temp_x, 72);
    ECC_ZeroReg((uint32_t *)crpt->ECC_Y1);

    if ((ret = run_ecc_codec(grp, ECCOP_MODULE | MODOP_ADD)))
    {
        return ret;
    }

    /*  (27) Read X1 registers to get x1 * (mod n) */

    /* 6. The signature is valid if x1 * = r, otherwise it is invalid */
    if (memcmp((uint8_t *)crpt->ECC_X1, (uint8_t *)r->MBEDTLS_PRIVATE(p), mbedtls_mpi_size(r)) != 0)
    {
        return MBEDTLS_ERR_ECP_VERIFY_FAILED;
    }


    return 0;
}

/*
 * Verify ECDSA signature of hashed message
 */
int mbedtls_ecdsa_verify(mbedtls_ecp_group *grp,
                         const unsigned char *buf, size_t blen,
                         const mbedtls_ecp_point *Q,
                         const mbedtls_mpi *r,
                         const mbedtls_mpi *s)
{
    int ret;

    ECDSA_VALIDATE_RET(grp != NULL);
    ECDSA_VALIDATE_RET(Q   != NULL);
    ECDSA_VALIDATE_RET(r   != NULL);
    ECDSA_VALIDATE_RET(s   != NULL);
    ECDSA_VALIDATE_RET(buf != NULL || blen == 0);

    ret = ECC_Verify(grp, buf, blen, Q, r, s);

    return (ret);
}
#endif /* MBEDTLS_ECDSA_VERIFY_ALT */
#endif /* MBEDTLS_ECDSA_C */
